app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "allday", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["allday", 0], ["note", ""], ["created_at", "2021-06-17 09:35:52.406893"], ["updated_at", "2021-06-17 09:35:52.406893"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["start_date", "2021-06-15"], ["end_date", "2021-06-16"], ["updated_at", "2021-06-17 09:05:45.848024"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)