app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "tasks"
---
      <h1>
        現在の日時: <%= Date.current.strftime('%Y年%m月%d日') %>　スケジュール合計: <%= Task.all.count%>